; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v2 ?v7)
		(pred_4 ?v4)
		(pred_5 ?v6)
		(pred_3 ?v6)
		(pred_1 ?v4 ?v6)
		(pred_2)
		(pred_6 ?v4))

   (:action op_2
       :parameters  (?v3 ?v5)
       :precondition (and (not-eq ?v3 ?v5) 
                          (pred_5 ?v3) (pred_5 ?v5) (pred_3 ?v3))
       :effect (and  (pred_3 ?v5)
		     (not (pred_3 ?v3))))


   (:action op_3
       :parameters (?v8 ?v1)
       :precondition  (and  (pred_4 ?v8) (pred_5 ?v1)
			    (pred_1 ?v8 ?v1) (pred_3 ?v1) (pred_2))
       :effect (and (pred_6 ?v8)
		    (not (pred_1 ?v8 ?v1)) 
		    (not (pred_2))))

   (:action op_1
       :parameters  (?v8  ?v1)
       :precondition  (and  (pred_4 ?v8) (pred_5 ?v1)
			    (pred_6 ?v8) (pred_3 ?v1))
       :effect (and (pred_1 ?v8 ?v1)
		    (pred_2)
		    (not (pred_6 ?v8)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_01 obj_07 obj_06 obj_02 obj_04 
          obj_03 obj_05 obj_08 
)
(:init
(pred_5 obj_01)
(pred_5 obj_07)
(pred_5 obj_06)
(pred_5 obj_02)
(pred_5 obj_04)
(pred_4 obj_03)
(pred_4 obj_05)
(pred_4 obj_08)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(pred_2)
(pred_1 obj_03 obj_07)
(pred_1 obj_05 obj_01)
(pred_1 obj_08 obj_02)
(pred_3 obj_07)
)
(:goal
(and
(pred_1 obj_03 obj_02)
(pred_1 obj_05 obj_02)
(pred_1 obj_08 obj_07)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_03 obj_02) (pred_3 obj_01))
    (sometime-before  (pred_1 obj_05 obj_02) (pred_3 obj_06))
    (sometime-before  (pred_1 obj_08 obj_07) (pred_3 obj_01))
  )
)
)

; plan
1. (op_2 obj_07 obj_01)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_01)
   goals met: 0 of 3
2. (op_3 obj_05 obj_01)
   deleted: (pred_1 obj_05 obj_01) (pred_2)
   added: (pred_6 obj_05)
   goals met: 0 of 3
3. (op_2 obj_01 obj_07)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_07)
   goals met: 0 of 3
4. (op_1 obj_05 obj_07)
   deleted: (pred_6 obj_05)
   added: (pred_1 obj_05 obj_07) (pred_2)
   goals met: 0 of 3
5. (op_2 obj_07 obj_02)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_02)
   goals met: 0 of 3
6. (op_3 obj_08 obj_02)
   deleted: (pred_1 obj_08 obj_02) (pred_2)
   added: (pred_6 obj_08)
   goals met: 0 of 3
7. (op_2 obj_02 obj_07)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_07)
   goals met: 0 of 3
8. (op_1 obj_08 obj_07)
   deleted: (pred_6 obj_08)
   added: (pred_1 obj_08 obj_07) (pred_2)
   goals met: 1 of 3
9. (op_3 obj_03 obj_07)
   deleted: (pred_1 obj_03 obj_07) (pred_2)
   added: (pred_6 obj_03)
   goals met: 1 of 3
10. (op_2 obj_07 obj_06)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_06)
   goals met: 1 of 3
11. (op_1 obj_03 obj_06)
   deleted: (pred_6 obj_03)
   added: (pred_1 obj_03 obj_06) (pred_2)
   goals met: 1 of 3
12. (op_2 obj_06 obj_07)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_07)
   goals met: 1 of 3
13. (op_3 obj_05 obj_07)
   deleted: (pred_1 obj_05 obj_07) (pred_2)
   added: (pred_6 obj_05)
   goals met: 1 of 3
14. (op_2 obj_07 obj_02)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_02)
   goals met: 1 of 3
15. (op_1 obj_05 obj_02)
   deleted: (pred_6 obj_05)
   added: (pred_1 obj_05 obj_02) (pred_2)
   goals met: 2 of 3
16. (op_2 obj_02 obj_06)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_06)
   goals met: 2 of 3
17. (op_3 obj_03 obj_06)
   deleted: (pred_1 obj_03 obj_06) (pred_2)
   added: (pred_6 obj_03)
   goals met: 2 of 3
18. (op_2 obj_06 obj_02)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_02)
   goals met: 2 of 3
19. (op_1 obj_03 obj_02)
   deleted: (pred_6 obj_03)
   added: (pred_1 obj_03 obj_02) (pred_2)
   goals met: 3 of 3
